tap "databricks/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "btop"
brew "glib"
brew "cmake"
brew "duckdb"
brew "fzf"
brew "git"
brew "go"
brew "graphviz"
brew "htop"
brew "jq"
brew "lua-language-server"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "pipx"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "telnet"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "zoxide"
brew "jesseduffield/lazygit/lazygit"

cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "hiddenbar"
cask "karabiner-elements"
cask "obsidian"
cask "slack"
cask "temurin"
cask "vlc"
cask "iterm2"
cask "shottr"
cask "visual-studio-code"
cask "raycast"
cask "google-chrome"
cask "1password"
